#### estrutura base

In [46]:
import pandas as pd
import numpy as np

In [47]:
string = ['a','b','c','d']
numeros = [1,2,3,4]
dis = {'string': string, 'numeros':numeros}

In [48]:
df = pd.DataFrame(dis)
df.columns #indica as colunas da df
df.index #conatgem das linhas da df, EX: start=0, stop=4, step=1
df.values  #retorna uma arrey numpy

array([['a', 1],
       ['b', 2],
       ['c', 3],
       ['d', 4]], dtype=object)

In [49]:
import numpy as np

df2 = pd.DataFrame({'a':np.linspace(0,100,90),'b': np.linspace(100,200,90) })


df2.head() #as primeiras linhas do df, os 5 primeiros, pode mostrar o numero de linhas que quiser usando df2.head(x)
df2.tail() #as ultimas linhas da df, os 5 ultimos, podendo mudar
df2.mean() #média da coluna values
df2.min() #minimo das colunas
df2.max() #maximo das colunas
df2.cumsum() #somatoria das linhas

              a             b
0      0.000000    100.000000
1      1.123596    201.123596
2      3.370787    303.370787
3      6.741573    406.741573
4     11.235955    511.235955
..          ...           ...
85  4106.741573  12706.741573
86  4203.370787  12903.370787
87  4301.123596  13101.123596
88  4400.000000  13300.000000
89  4500.000000  13500.000000

[90 rows x 2 columns]

In [50]:
df['string'].value_counts() #faz a contagem de valores dados
df.sort_values(by='string') #ordena os valores

  string  numeros
0      a        1
1      b        2
2      c        3
3      d        4

.loc[] .iloc[]

In [51]:
df3 = pd.read_csv('C:/Users/mathe/OneDrive/Documentos/matheus/Python-para-Engenheiros-e-Cientistas-main/Notebooks/arquivos_auxiliares/datasets_1358_30676_Players.csv')
df3.head()

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
0,0,Curly Armstrong,180.0,77.0,Indiana University,1918.0,NaN,NaN
1,1,Cliff Barker,188.0,83.0,University of Kentucky,1921.0,Yorktown,Indiana
2,2,Leo Barnhorst,193.0,86.0,University of Notre Dame,1924.0,NaN,NaN
3,3,Ed Bartels,196.0,88.0,North Carolina State University,1925.0,NaN,NaN
4,4,Ralph Beard,178.0,79.0,University of Kentucky,1927.0,Hardinsburg,Kentucky

In [52]:
df3.columns

Index(['Unnamed: 0', 'Player', 'height', 'weight', 'collage', 'born',
       'birth_city', 'birth_state'],
      dtype='object')

In [53]:
df3.loc[1:4,['height','birth_city']] #tratra os dados pegando o numero de linhas determinado e a coluna especificada

   height   birth_city
1   188.0     Yorktown
2   193.0          NaN
3   196.0          NaN
4   178.0  Hardinsburg

In [54]:
df3.loc[1:4:2,'height':'birth_city':] #fzendo o mesmo mas em intervalos

   height  weight                          collage    born birth_city
1   188.0    83.0           University of Kentucky  1921.0   Yorktown
3   196.0    88.0  North Carolina State University  1925.0        NaN

In [55]:
df3.iloc[0:4,2:4] #funciona da mesma maneira que o loc, mas de maneira numerica

   height  weight
0   180.0    77.0
1   188.0    83.0
2   193.0    86.0
3   196.0    88.0

##### contact e merge

In [56]:
dfa = pd.DataFrame(np.arange(15).reshape(5,3))
dfb = pd.DataFrame((np.arange(9)**2).reshape(3,3))

In [57]:
pd.concat([dfa,dfb],ignore_index='True') #literalmente junta dataframes, colocando um após o outro

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14
5   0   1   4
6   9  16  25
7  36  49  64

In [58]:
df1 = pd.DataFrame({'id':[1,2,3] , 'cor':['preto','verde','vermelho']})

df2 = pd.DataFrame({'times': ['time1','time2','time3','time4','time5'],'id':[1,2,3,2,4]})

In [59]:
pd.merge(df1,df2) #fundiu as duas tabelas, cruzamento de dados

   id       cor  times
0   1     preto  time1
1   2     verde  time2
2   2     verde  time4
3   3  vermelho  time3

In [60]:
df11 = pd.DataFrame({'id':[1,2,3] , 'cor':['preto','verde','vermelho']})

df22 = pd.DataFrame({'times': ['time1','time2','time3','time4','time5'],'id_cor':[1,2,3,2,4]})

In [61]:
pd.merge(df11,df22, left_on ='id',right_on='id_cor') #fundiu as duas tabelas, cruzamento de dados

   id       cor  times  id_cor
0   1     preto  time1       1
1   2     verde  time2       2
2   2     verde  time4       2
3   3  vermelho  time3       3

### Indices boleanos 'Filtros'

In [62]:
dfi = pd.read_csv('C:/Users/mathe/OneDrive/Documentos/matheus/Python-para-Engenheiros-e-Cientistas-main/Notebooks/arquivos_auxiliares/datasets_1358_30676_Players.csv')

In [63]:
dfi.columns

Index(['Unnamed: 0', 'Player', 'height', 'weight', 'collage', 'born',
       'birth_city', 'birth_state'],
      dtype='object')

In [64]:
dfi['birth_state'].value_counts()

New York        283
California      240
Illinois        201
Pennsylvania    160
Ohio            135
               ...
Norway            1
Iceland           1
Maine             1
Finland           1
Austria           1
Name: birth_state, Length: 127, dtype: int64

In [65]:
from_california = dfi['birth_state'] == 'California' #operação boleana

from_california.value_counts()

False    3682
True      240
Name: birth_state, dtype: int64

In [66]:
dfi[from_california].head()

,Unnamed: 0,Player,height,weight,collage,born,birth_city,birth_state
22,22,Bill Calhoun,190.0,81.0,City College of San Francisco,1927.0,San Francisco,California
50,50,Bob Feerick,190.0,86.0,Santa Clara University,1920.0,San Francisco,California
74,74,Alex Hannum*,201.0,95.0,University of Southern California,1923.0,Los Angeles,California
117,117,John Mandic,193.0,92.0,Oregon State University,1919.0,Los Angeles,California
130,130,Vern Mikkelsen*,201.0,104.0,Hamline University,1928.0,Fresno,California

### Tabela dinâmica

In [67]:
dff = pd.read_csv('C:/Users/mathe/OneDrive/Documentos/matheus/zebra/Equipe_DEV/Testes-Graduacao/curso python/Curso_Bibliotecas/pandasdata/Acoes_ficticias.csv',delimiter=';')

dff.head()

   Papel  preco_compra  Quantidade
0  PETR4     92.114785         100
1  VVAR3     17.519059         100
2  ITSA4     56.375177         200
3  ITSA4     62.284332         300
4  EMBR3     80.626768         100

In [68]:
dff.columns

Index(['Papel', 'preco_compra', 'Quantidade'], dtype='object')

In [69]:
pd.pivot_table(dff, index = 'Papel')

       Quantidade  preco_compra
Papel
EMBR3  225.000000     60.529087
ITSA4  225.000000     69.715790
PETR4  157.142857     49.646652
VVAR3  200.000000     31.462784

In [70]:
pd.pivot_table(dff, index = 'Papel', values ='Quantidade')

       Quantidade
Papel
EMBR3  225.000000
ITSA4  225.000000
PETR4  157.142857
VVAR3  200.000000

In [71]:
pd.pivot_table(dff, index = 'Papel', values ='Quantidade', aggfunc='sum')

       Quantidade
Papel
EMBR3         900
ITSA4         900
PETR4        1100
VVAR3         800

In [72]:
dff['valor_total'] = dff['preco_compra']*dff['Quantidade']
dff.head()

   Papel  preco_compra  Quantidade   valor_total
0  PETR4     92.114785         100   9211.478515
1  VVAR3     17.519059         100   1751.905894
2  ITSA4     56.375177         200  11275.035362
3  ITSA4     62.284332         300  18685.299477
4  EMBR3     80.626768         100   8062.676817

In [73]:
som_qunat = pd.pivot_table(dff, index = 'Papel', values =['Quantidade', 'valor_total'], aggfunc='sum')

som_qunat

       Quantidade   valor_total
Papel
EMBR3         900  49838.769433
ITSA4         900  61451.615028
PETR4        1100  43671.836644
VVAR3         800  22637.653709

### Tratando dados

### Limpando dados

In [91]:
a_rr = np.arange(20).reshape(4,5)
colun = ['a','b','c','d','e']

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19]])

In [94]:
dfj = pd.DataFrame(a_rr,columns = colun)
dfj

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [95]:
dfj.drop(index=2) #remove a linha

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
3  15  16  17  18  19

In [96]:
dfj.drop(columns='c') #remove uma coluna

    a   b   d   e
0   0   1   3   4
1   5   6   8   9
2  10  11  13  14
3  15  16  18  19